In [34]:
import pandas as pd

In [35]:
import seaborn as sns
planets = sns.load_dataset('planets')
# get: shape, head, check for na, drop nas, and check out the result of describe

print(planets.shape)
print(planets.head(5))
print(planets.tail(5))

# condition to prove there are columns in some rows that do not have all data
print(planets.notna().all())
# this is the wrong condition, brings sadness and false hopes
# looking for values that aren't NaNs - if there are any valid values, the .all will return False for the column
#print(planets.isna().all())
print(planets.describe())
# playing with dropping all rows that have any missing data
print(planets.dropna().shape)
#planets = planets.dropna()

(1035, 6)
            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009
       method  number  orbital_period  mass  distance  year
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008
            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000
(498, 6)

In [36]:
print(planets.groupby('method')['orbital_period'].median())

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [49]:
#Looking at the chipotle extra credit: get order totals
chipotle_orders = pd.read_csv("chipotle.tsv", sep='\t')
chipotle_orders['item_price'] = chipotle_orders['item_price'].replace({'\$': '', ',': ''}, regex=True).astype(float)

# gets order totals, but what if we wanted that as part of our dataframe?
#total_price = chipotle_orders.groupby('order_id')['item_price'].sum()
#print(total_price)
# does not get relationship between order_id and total_price
# chipotle_orders['total_price'] = chipotle_orders.groupby('order_id')['item_price'].sum()
# googled: add groupby column to dataframe
# https://stackoverflow.com/questions/37189878/pandas-add-column-to-groupby-dataframe
total_price = chipotle_orders.groupby('order_id')['item_price'].sum().reset_index(name='total_price')

print(total_price)
chipotle_orders_totals = chipotle_orders.merge(total_price)
#print(chipotle_orders_totals)
#print(chipotle_orders_totals.columns)
print(chipotle_orders_totals[['order_id', 'item_price', 'total_price']])

chipotle_orders.groupby('order_id')['item_price'].describe()
chipotle_orders_totals.describe()

      order_id  total_price
0            1        11.56
1            2        16.98
2            3        12.67
3            4        21.00
4            5        13.70
...        ...          ...
1829      1830        23.00
1830      1831        12.90
1831      1832        13.20
1832      1833        23.50
1833      1834        28.75

[1834 rows x 2 columns]
      order_id  item_price  total_price
0            1        2.39        11.56
1            1        3.39        11.56
2            1        3.39        11.56
3            1        2.39        11.56
4            2       16.98        16.98
...        ...         ...          ...
4617      1833       11.75        23.50
4618      1833       11.75        23.50
4619      1834       11.25        28.75
4620      1834        8.75        28.75
4621      1834        8.75        28.75

[4622 rows x 3 columns]

          order_id     quantity   item_price  total_price
count  4622.000000  4622.000000  4622.000000  4622.000000
mean    927.254868     1.075725     7.464336    23.178576
std     528.890796     0.410186     4.245557    21.470839
min       1.000000     1.000000     1.090000    10.080000
25%     477.250000     1.000000     3.390000    12.980000
50%     926.000000     1.000000     8.750000    17.500000
75%    1393.000000     1.000000     9.250000    24.487500
max    1834.000000    15.000000    44.250000   205.250000

In [38]:
titanic = sns.load_dataset('titanic')
print(titanic.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [39]:
print(titanic.groupby('sex')[['survived']].mean())

        survived
sex
female  0.742038
male    0.188908

In [40]:
print(titanic.pivot_table('survived', index='sex', columns='class'))

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [41]:
age = pd.cut(titanic['age'], [0, 18, 80])
print(age)
print(titanic.pivot_table('survived', ['sex', age], 'class'))

0      (18.0, 80.0]
1      (18.0, 80.0]
2      (18.0, 80.0]
3      (18.0, 80.0]
4      (18.0, 80.0]
           ...
886    (18.0, 80.0]
887    (18.0, 80.0]
888             NaN
889    (18.0, 80.0]
890    (18.0, 80.0]
Name: age, Length: 891, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 80]]
class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663